export const defaultCharacters = [
  "혜진이",
  "응애나또아가할래",
  "나혜찌니",
  "적묵법",
  "흐앙계란주께",
  "도빵울",
  "이풀립",
  "콩당콩설",
  "이콩덩",
  "다굥이의기묘한모험",
];

export const myCharacters = [
    "스읔꺼내보니유산스읔",
    "바훈망치",
    "배쉬증함",
    "상급소환수서머너",
    "휴지없어서손으로또닦음",
    "리퍼님거절누르는것도힘듬",
    "암살자길동",
    "리퍼길동이",
    "리퍼길동",
    "악마길동",
    "또딴a",
    "이런곰같은여우를봤니",
    "저달호",
    "김겸필",
    "이겸필",
    "박겸필",
    "강겸필",
];

export const raidGoldTable = {
  "4막": { "노말": 16500, "하드": 42000 },
  "종막": { "노말": 20000, "하드": 52000 },
  "세르카": { "노말": 17500, "하드": 44000, "나메": 54000 },
  "성당": { "1단계": 30000, "2단계": 40000, "3단계": 50000 }
};

export const DAILY_RESET_HOUR = 6;

export const homeworkGroups = {
  general: ["쿠르잔전선", "가디언토벌", "할의모래시계"],
  raid: ["4막", "종막", "세르카", "성당"]
};

export const MAX_GAUGE = 200;
export const raidOrder = ["4막", "종막", "세르카", "성당"];
